#!/usr/bin/env python3
import numpy as np
import pandas as pd

population={
    2000: {
        '北京': 13820000,
        '天津': 10010000,
        '河北': 67440000,
        '山西': 32970000,
        '内蒙古': 23760000,
        '辽宁': 42380000,
        '吉林': 27280000,
        '黑龙江': 36890000,
        '上海': 16740000,
        '江苏': 74380000,
        '浙江': 46770000,
        '安徽': 59860000,
        '福建': 34710000,
        '江西': 41400000,
        '山东': 90790000,
        '河南': 92560000,
        '湖北': 60280000,
        '湖南': 64400000,
        '广东': 86420000,
        '广西': 44890000,
        '海南': 7870000,
        '重庆': 30900000,
        '四川': 83290000,
        '贵州': 35250000,
        '云南': 42880000,
        '西藏': 2620000,
        '陕西': 36050000,
        '甘肃': 25620000,
        '青海': 5180000,
        '宁夏': 5620000,
        '新疆': 19250000,
    },
    2010: {
        '北京': 19612368,
        '天津': 12938224,
        '河北': 71854202,
        '山西': 35712111,
        '内蒙古': 24706321,
        '辽宁': 43746323,
        '吉林': 27462297,
        '黑龙江': 38312224,
        '上海': 23019148,
        '江苏': 78659903,
        '浙江': 54426891,
        '安徽': 59500510,
        '福建': 36894216,
        '江西': 44567475,
        '山东': 95793065,
        '河南': 94023567,
        '湖北': 57237740,
        '湖南': 65683722,
        '广东': 104303132,
        '广西': 46026629,
        '海南': 8671518,
        '重庆': 28846170,
        '四川': 80418200,
        '贵州': 34746468,
        '云南': 45966239,
        '西藏': 3002166,
        '陕西': 37327378,
        '甘肃': 25575254,
        '青海': 5626722,
        '宁夏': 6301350,
        '新疆': 21813334,
    },
    2020: {
        '北京': 21893095,
        '天津': 13866009,
        '河北': 74610235,
        '山西': 34915616,
        '内蒙古': 24049155,
        '辽宁': 42591407,
        '吉林': 24073453,
        '黑龙江': 31850088,
        '上海': 24870895,
        '江苏': 84748016,
        '浙江': 64567588,
        '安徽': 61027171,
        '福建': 41540086,
        '江西': 45188635,
        '山东': 101527453,
        '河南': 99365519,
        '湖北': 57752557,
        '湖南': 66444864,
        '广东': 126012510,
        '广西': 50126804,
        '海南': 10081232,
        '重庆': 32054159,
        '四川': 83674866,
        '贵州': 38562148,
        '云南': 47209277,
        '西藏': 3648100,
        '陕西': 39528999,
        '甘肃': 25019831,
        '青海': 5923957,
        '宁夏': 7202654,
        '新疆': 25852345
    }
}


def main():
    ratio1 = {k: np.power(population[2010][k] / population[2000][k], 1 / 10) for k in population[2020]}
    for year in range(2001, 2010):
        population[year] = {
            k: round(population[2000][k] * np.power(ratio1[k], year - 2000)) for k in population[2000]
        }
    
    ratio2 = {k: np.power(population[2020][k] / population[2010][k], 1 / 10) for k in population[2020]}
    for year in range(2011, 2020):
        population[year] = {
            k: round(population[2010][k] * np.power(ratio2[k], year - 2010)) for k in population[2010]
        }
    with open('./students.txt', 'r') as f:
        df = pd.read_csv(f, sep='\t')
        popul = []
        
    for i in range(len(df)):
        popul.append(population[df.loc[i]['年份']][df.loc[i]['省份']])
    df['总人口'] = popul
    
    with open('students.txt', 'w') as f:
        df.to_csv(f, sep='\t', index=False, header=True, encoding="utf-8")
    
    
if __name__=="__main__":
    main()
